In [1]:
from pyspark.sql import SparkSession
import pandas as pd

spark = SparkSession.builder.master("local").appName("spark-dataframe").getOrCreate()

filepath = "/home/ubuntu/working/spark/data/titanic_train.csv"

titanic_sdf = spark.read.csv(filepath, inferSchema=True,header=True)
titanic_pdf = pd.read_csv(filepath)

Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/03/28 17:02:22 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/03/28 17:02:23 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
24/03/28 17:02:23 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

# 데이터 조작
- 데이터 프레임에 대한 삽입 수정 삭제 등

## Pandas DataFrame에서의 데이터 조작 기법
- 컬럼에 대한 삽입과 수정을 쉽게 할 수 있다.
- []

In [3]:
titanic_pdf_copy = titanic_pdf.copy()

In [6]:
# 판다스 데이터 프레임에서 데이터 생성(Insert) : dictionary 처럼 대괄호 안에 집어 넣으면 된다.
titanic_pdf_copy["Extra_Fare"] = titanic_pdf_copy["Fare"] * 10
titanic_pdf_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,72.500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,712.833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,79.250

In [7]:
# 데이터 수정. 삽입과 문법이 동일하다.
titanic_pdf_copy["Extra_Fare"] = titanic_pdf_copy["Fare"] + 20
titanic_pdf_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,27.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,91.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,27.9250

## Spark Dataframe 데이터 조작
- `withColumn()` 메소드를 이용하여 수정 타입변경, 신규컬럼 추가를 수행한다.
    - `withColumn`(신규 또는 업데이트 되는 컬럼명, 신규 도는 업데이트 되는 값)
- 신규 또는 업데이트 되는 값을 생성시 기존컬럼을 기반으로 한다면,
    - 신규 컬럼은 **문자열**로 지정
    - 기존 컬럼은 `col`을 사용한다.
- 신규컬럼을 추가하는 것은 `select`로도 가능
- 컬럼명 변경은 `withColumnRename()` 메소드를 사용

In [20]:
import pyspark.sql.functions as F

# 신규컬럼 추가하기
titanic_sdf_copy = titanic_sdf.select("*")
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare",F.col("Fare") * 10)
titanic_sdf_copy.select("Fare","Extra_Fare").show(1)

+----+----------+
|Fare|Extra_Fare|
+----+----------+
|7.25|      72.5|
+----+----------+
only showing top 1 row

In [22]:
# 수정하기
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", F.col("Fare") + 20)
titanic_sdf_copy.select("Fare","Extra_Fare").show()

+-------+----------+
|   Fare|Extra_Fare|
+-------+----------+
|   7.25|     27.25|
|71.2833|   91.2833|
|  7.925|    27.925|
|   53.1|      73.1|
|   8.05|     28.05|
| 8.4583|   28.4583|
|51.8625|   71.8625|
| 21.075|    41.075|
|11.1333|   31.1333|
|30.0708|   50.0708|
|   16.7|      36.7|
|  26.55|     46.55|
|   8.05|     28.05|
| 31.275|    51.275|
| 7.8542|   27.8542|
|   16.0|      36.0|
| 29.125|    49.125|
|   13.0|      33.0|
|   18.0|      38.0|
|  7.225|    27.225|
+-------+----------+
only showing top 20 rows

In [24]:
# 컬럼 타입 변환
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare",F.col("Extra_Fare").cast("Integer"))
titanic_sdf_copy.select("Extra_Fare").show(3)

+----------+
|Extra_Fare|
+----------+
|        27|
|        91|
|        27|
+----------+
only showing top 3 rows

# 리터럴
- 프로그래밍 언어에서 코드에 등장하는 직접적인 값들을 literal 이라고 한다.
- 리터럴은 상수

In [27]:
titanic_pdf_copy["Extra_Fare"] = 10
titanic_pdf_copy.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,10
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,10
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,10

In [30]:
# spark에서 리터럴로 데이터를 삽입하거나 수정하기
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", 10)
# Spark에서는 리터럴에 대한 브로드 캐스팅이 자동으로 실행되지 않는다! 그래서 오류가 나는 것임.

TypeError: col should be Column

In [33]:
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", F.lit(10))
titanic_sdf_copy.select("*").show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|Extra_Fare|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|        10|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|        10|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|        10|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|        10|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|        10|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|        10|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|        10|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|        10|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|        10|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|        10|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|        10|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|        10|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|        10|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|        10|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|        10|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|        10|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|        10|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|        10|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|        10|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|        10|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
only showing top 20 rows

## Select를 활용해서 컬럼 업데이트 하기

In [46]:
# sql : SELECT *, Embarked as E 
#       FROM titanic_sdf_copy;

titanic_sdf_copy.select("*", F.col("Embarked").alias("집집")).show(3)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|집집|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|   S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|   C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|   S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+
only showing top 3 rows

In [48]:
# Cabin에서 첫 알파벳 글자만 추출해서 CabinSection컬럼 추가

# titanic_sdf_copy = titanic_sdf.select("*")
titanic_sdf_copy = titanic_sdf_copy.select("*",F.substring("Cabin",0,1).alias("3"))
titanic_sdf_copy.show(3)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+----+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|   3|   3|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+----+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|null|null|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|   C|   C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|null|null|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----+----+
only showing top 3 rows

In [61]:
# F.split(컬럼명, 나눌문자)
# First_name 컬럼과 last_name컬럼 추가. withColumn 사용하기
# split 하고 나서 getitem(0), getItem(1)

# Hint : F.split(이름, ",").getItem

titanic_sdf_copy = titanic_sdf.select("*")

titanic_sdf_copy.withColumn("First_name",F.split("Name",",")).show(2)

# 정답
titanic_sdf_copy.withColumn("first_name", F.split(("Name"),",").getItem(0))\
                .withColumn("last_name", F.split(("Name"), ",").getItem(1)).show(2)

titanic_sdf_copy.withColumn("first_name", F.split(F.col("Name"),",").getItem(0))\
                .withColumn("last_name", F.split(F.col("Name"), ",").getItem(1)).show(2)

+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|   Fare|Cabin|Embarked|          First_name|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|A/5 21171|   7.25| null|       S|[Braund,  Mr. Owe...|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0| PC 17599|71.2833|  C85|       C|[Cumings,  Mrs. J...|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+--------------------+
only showing top 2 rows

+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|   Fare|Cabin|Embarked|first_name|           last_name|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|A/5 21171|   7.25| null|       S|    Braund|     Mr. Owen Harris|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0| PC 17599|71.2833|  C85|       C|   Cumings| Mrs. John Bradle...|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
only showing top 2 rows

+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|   Ticket|   Fare|Cabin|Embarked|first_name|           last_name|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|A/5 21171|   7.25| null|       S|    Braund|     Mr. Owen Harris|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0| PC 17599|71.2833|  C85|       C|   Cumings| Mrs. John Bradle...|
+-----------+--------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----------+--------------------+
only showing top 2 rows

In [64]:
titanic_sdf_copy.withColumnRenamed("Fare","요금").printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- 요금: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [65]:
spark.stop()